/* eslint-disable import/prefer-default-export */
import { ShowcaseLetter } from 'components/LetterShowcase/type';

export const SAMPLE_LETTERS: ShowcaseLetter[] = [
  {
    id: '1',
    type: 'letter',
    petName: '두부',
    content: `두부야 온 마음을 다 해서 사랑해!🩷`,
  },
  {
    id: '2',
    type: 'letter',
    petName: '방울이',
    content: `방울아....잘 지내고 잇겟지...?아프지않고....사랑해.... 💕`,
  },
  {
    id: '3',
    type: 'letter',
    petName: '짱아',
    content: `짱아 엄마가 많이 사랑하고 보고싶어 그리고 미안해`,
  },
  {
    id: '4',
    type: 'letter',
    petName: '링고',
    content: `링고야 사랑해 늘 내 마음속에 함께 있어 보고파🤍`,
  },
  {
    id: '5',
    type: 'letter',
    petName: '코코',
    content: `코코야 너무너무 보고 싶어 사랑해`,
  },
  {
    id: '6',
    type: 'letter',
    petName: '숙정이',
    content: `숙정아 누나가 많이 미안해`,
  },
  {
    id: '7',
    type: 'letter',
    petName: '쭈니',
    content: `쭈나 무지개나라 친구들은 많이 사귀었어?`,
  },
  {
    id: '8',
    type: 'letter',
    petName: '몽이',
    content: `몽이야 정말 고마웠어. 이제 편히 쉬어.`,
  },
  {
    id: '9',
    type: 'reply',
    petName: '태양',
    content: `바람이 부는 날에는 태양이가 보낸 향기를 느낄 수 있을 거야. 매일 웃어줘.`,
  },
  {
    id: '10',
    type: 'reply',
    petName: '미니',
    content: `엄마의 사랑이 느껴져서 마음이 따뜻해`,
  },
  {
    id: '11',
    type: 'reply',
    petName: '똘이',
    content: `똘이는 언제나 누나를 응원하고 있을께`,
  },
  {
    id: '12',
    type: 'reply',
    petName: '달퐁이',
    content: `천국에서 산책 잘하지!`,
  },
  {
    id: '13',
    type: 'reply',
    petName: '까미',
    content: `언니 나 잘 놀고있어`,
  },
  {
    id: '14',
    type: 'reply',
    petName: '꼭지',
    content: `시험이랑 친구 문제로 고민 많겠지만, 꼭지는 언제나 네 편이야.`,
  },
  {
    id: '15',
    type: 'letter',
    petName: '가을',
    content: `내 사랑 내 전부 아기 천사 가을아 잘 놀고 있어 엄마랑 곧 만나자 사랑해`,
  },
  {
    id: '16',
    type: 'letter',
    petName: '루피',
    content: `엄마.아빠는 항상 널 보고 싶어 한단다. 사랑해.아들`,
  },
  {
    id: '17',
    type: 'letter',
    petName: '뚱바',
    content: `우리뚱 많이보고싶고, 많이사랑해♥️`,
  },
  {
    id: '18',
    type: 'letter',
    petName: '미르',
    content: `엄마가 너무 마니 미안해 너무 마니 보고싶어 우리 꼭 다시 만나자 사랑해 ♡♡`,
  },
];
