/* eslint-disable import/prefer-default-export */
import { ShowcaseLetter } from 'components/LetterShowcase/type';

export const SHOWCASE_LETTERS: ShowcaseLetter[] = [
  {
    id: '1',
    type: 'letter',
    petName: '슈가',
    content: `네가 잘 지냈으면 좋겠어`,
  },
  {
    id: '2',
    type: 'letter',
    petName: '방울',
    content: `방울아 기일날 와서 많이 먹구가렴...사랑해..보고싶다...`,
  },
  {
    id: '3',
    type: 'letter',
    petName: '쪼꼬',
    content: `내착한 내동생 내껌딱지 쪼꼬 나와 함께해줘서 너무 고마웠고 영원히 사랑해`,
  },
  {
    id: '4',
    type: 'letter',
    petName: '리오',
    content: `사랑해. 또 만나자.`,
  },
  {
    id: '5',
    type: 'letter',
    petName: '아리',
    content: `아리야 너무 보고싶다 아리 덕분에 너무 행복했어 너무 고맙고 많이 사랑해♥️`,
  },
  {
    id: '6',
    type: 'letter',
    petName: '아리',
    content: `아리야 우리가 많이 사랑해❤️`,
  },
  {
    id: '7',
    type: 'letter',
    petName: '아지',
    content: `엄마가 세상에서 그 누구보다 아지를 제일 많이 사랑한다 정말 사랑한다 보고싶어`,
  },
  {
    id: '8',
    type: 'reply',
    petName: '솔이',
    content: `솔이도 엄마 사랑해! 보고 싶어! 찰나의 시간에 다시 만나기로. 사랑해, 엄마!`,
  },
  {
    id: '9',
    type: 'reply',
    petName: '칸초',
    content: `엄마, 가끔 하늘을 봐줘. 우리는 연결 되어 있으니까.`,
  },
  {
    id: '10',
    type: 'reply',
    petName: '망고',
    content: `항상 마음속에 있을게, 누나의 귀여운 강아지, 망고.`,
  },
  {
    id: '11',
    type: 'reply',
    petName: '사랑',
    content: `사랑이가 하늘나라에서 보내는 인사를 받아줘, 보고 싶고 또 고맙습니다 💖`,
  },
];
